{
  "_name_or_path": "google/vit-base-patch16-224-in21k",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "finetuning_task": "image-classification",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "LABEL_0",
    "1": "LABEL_1",
    "2": "LABEL_2",
    "3": "LABEL_3",
    "4": "LABEL_4",
    "5": "LABEL_5",
    "6": "LABEL_6",
    "7": "LABEL_7",
    "8": "LABEL_8",
    "9": "LABEL_9",
    "10": "LABEL_10",
    "11": "LABEL_11",
    "12": "LABEL_12",
    "13": "LABEL_13",
    "14": "LABEL_14",
    "15": "LABEL_15",
    "16": "LABEL_16",
    "17": "LABEL_17",
    "18": "LABEL_18",
    "19": "LABEL_19",
    "20": "LABEL_20",
    "21": "LABEL_21",
    "22": "LABEL_22",
    "23": "LABEL_23",
    "24": "LABEL_24",
    "25": "LABEL_25",
    "26": "LABEL_26",
    "27": "LABEL_27",
    "28": "LABEL_28",
    "29": "LABEL_29",
    "30": "LABEL_30",
    "31": "LABEL_31",
    "32": "LABEL_32",
    "33": "LABEL_33",
    "34": "LABEL_34",
    "35": "LABEL_35",
    "36": "LABEL_36",
    "37": "LABEL_37",
    "38": "LABEL_38",
    "39": "LABEL_39",
    "40": "LABEL_40",
    "41": "LABEL_41",
    "42": "LABEL_42",
    "43": "LABEL_43",
    "44": "LABEL_44",
    "45": "LABEL_45",
    "46": "LABEL_46",
    "47": "LABEL_47",
    "48": "LABEL_48",
    "49": "LABEL_49",
    "50": "LABEL_50",
    "51": "LABEL_51",
    "52": "LABEL_52",
    "53": "LABEL_53",
    "54": "LABEL_54",
    "55": "LABEL_55",
    "56": "LABEL_56",
    "57": "LABEL_57",
    "58": "LABEL_58",
    "59": "LABEL_59",
    "60": "LABEL_60",
    "61": "LABEL_61",
    "62": "LABEL_62",
    "63": "LABEL_63",
    "64": "LABEL_64",
    "65": "LABEL_65",
    "66": "LABEL_66",
    "67": "LABEL_67",
    "68": "LABEL_68",
    "69": "LABEL_69",
    "70": "LABEL_70",
    "71": "LABEL_71",
    "72": "LABEL_72",
    "73": "LABEL_73",
    "74": "LABEL_74",
    "75": "LABEL_75",
    "76": "LABEL_76",
    "77": "LABEL_77",
    "78": "LABEL_78",
    "79": "LABEL_79",
    "80": "LABEL_80",
    "81": "LABEL_81",
    "82": "LABEL_82",
    "83": "LABEL_83",
    "84": "LABEL_84",
    "85": "LABEL_85",
    "86": "LABEL_86",
    "87": "LABEL_87",
    "88": "LABEL_88",
    "89": "LABEL_89",
    "90": "LABEL_90",
    "91": "LABEL_91",
    "92": "LABEL_92",
    "93": "LABEL_93",
    "94": "LABEL_94",
    "95": "LABEL_95",
    "96": "LABEL_96",
    "97": "LABEL_97",
    "98": "LABEL_98",
    "99": "LABEL_99"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "apple": "0",
    "aquarium_fish": "1",
    "baby": "2",
    "bear": "3",
    "beaver": "4",
    "bed": "5",
    "bee": "6",
    "beetle": "7",
    "bicycle": "8",
    "bottle": "9",
    "bowl": "10",
    "boy": "11",
    "bridge": "12",
    "bus": "13",
    "butterfly": "14",
    "camel": "15",
    "can": "16",
    "castle": "17",
    "caterpillar": "18",
    "cattle": "19",
    "chair": "20",
    "chimpanzee": "21",
    "clock": "22",
    "cloud": "23",
    "cockroach": "24",
    "couch": "25",
    "cra": "26",
    "crocodile": "27",
    "cup": "28",
    "dinosaur": "29",
    "dolphin": "30",
    "elephant": "31",
    "flatfish": "32",
    "forest": "33",
    "fox": "34",
    "girl": "35",
    "hamster": "36",
    "house": "37",
    "kangaroo": "38",
    "keyboard": "39",
    "lamp": "40",
    "lawn_mower": "41",
    "leopard": "42",
    "lion": "43",
    "lizard": "44",
    "lobster": "45",
    "man": "46",
    "maple_tree": "47",
    "motorcycle": "48",
    "mountain": "49",
    "mouse": "50",
    "mushroom": "51",
    "oak_tree": "52",
    "orange": "53",
    "orchid": "54",
    "otter": "55",
    "palm_tree": "56",
    "pear": "57",
    "pickup_truck": "58",
    "pine_tree": "59",
    "plain": "60",
    "plate": "61",
    "poppy": "62",
    "porcupine": "63",
    "possum": "64",
    "rabbit": "65",
    "raccoon": "66",
    "ray": "67",
    "road": "68",
    "rocket": "69",
    "rose": "70",
    "sea": "71",
    "seal": "72",
    "shark": "73",
    "shrew": "74",
    "skunk": "75",
    "skyscraper": "76",
    "snail": "77",
    "snake": "78",
    "spider": "79",
    "squirrel": "80",
    "streetcar": "81",
    "sunflower": "82",
    "sweet_pepper": "83",
    "table": "84",
    "tank": "85",
    "telephone": "86",
    "television": "87",
    "tiger": "88",
    "tractor": "89",
    "train": "90",
    "trout": "91",
    "tulip": "92",
    "turtle": "93",
    "wardrobe": "94",
    "whale": "95",
    "willow_tree": "96",
    "wolf": "97",
    "woman": "98",
    "worm": "99"
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.42.2"
}
