{
  "_name_or_path": "google/vit-base-patch16-224-in21k",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "finetuning_task": "image-classification",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "LABEL_0",
    "1": "LABEL_1",
    "2": "LABEL_2",
    "3": "LABEL_3",
    "4": "LABEL_4",
    "5": "LABEL_5",
    "6": "LABEL_6",
    "7": "LABEL_7",
    "8": "LABEL_8",
    "9": "LABEL_9",
    "10": "LABEL_10",
    "11": "LABEL_11",
    "12": "LABEL_12",
    "13": "LABEL_13",
    "14": "LABEL_14",
    "15": "LABEL_15",
    "16": "LABEL_16",
    "17": "LABEL_17",
    "18": "LABEL_18",
    "19": "LABEL_19"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "aquatic_mammals": "0",
    "fish": "1",
    "flowers": "2",
    "food_containers": "3",
    "fruit_and_vegetables": "4",
    "household_electrical_devices": "5",
    "household_furniture": "6",
    "insects": "7",
    "large_carnivores": "8",
    "large_man-made_outdoor_things": "9",
    "large_natural_outdoor_scenes": "10",
    "large_omnivores_and_herbivores": "11",
    "medium_mammals": "12",
    "non-insect_invertebrates": "13",
    "people": "14",
    "reptiles": "15",
    "small_mammals": "16",
    "trees": "17",
    "vehicles_1": "18",
    "vehicles_2": "19"
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.42.2"
}
